app/Controllers/Cliente.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $clientes = $this->cliente_model->findAll();

SELECT *
FROM `clientes`
WHERE `id` = '1'
 LIMIT 1
---
    public function edit($cliente_id)
    {
        $cliente = $this->cliente_model
                        ->where('id', $cliente_id)
                        ->first();

UPDATE `clientes` SET `nome` = 'Junnyldo Costa', `data_de_nascimento` = '1993-08-02', `telefone` = '41998475685', `endereco` = 'Rua Mário Colombo, 94, Alto Boqueirão - Curitiba/PR', `limite_de_credito` = '50.000,00', `updated_at` = '2024-02-26 18:31:01'
WHERE `id` = '1'
---
    public function store()
    {
        $dados = $this->request->getVar();
        // dd($dados);

        if (isset($dados['cliente_id'])):

            $this->cliente_model
                 ->where('id', $dados['cliente_id'])
                 ->set($dados)
                 ->update();

DELETE FROM `clientes`
WHERE `id` = '11'
---
    public function delete($cliente_id)
    {
        $this->cliente_model
             ->where('id', $cliente_id)
             ->delete();

SELECT *
FROM `clientes`
WHERE `id` = '2'
 LIMIT 1
---
    public function read($cliente_id)
    {
        $cliente = $this->cliente_model
                         ->where('id', $cliente_id)
                         ->first();