app/Controllers/Funcionario.php

    public function index()
    {
        $data['funcionarios'] = $this->funcionario_model
                                     ->findAll();
---
SELECT *
FROM `funcionarios`

    public function edit($funcionario_id)
    {
        $funcionario = $this->funcionario_model
                        ->where('id', $funcionario_id)
                        ->first();
---
SELECT *
FROM `funcionarios`
WHERE `id` = '1'
 LIMIT 1

    public function read($funcionario_id)
    {
        $funcionario = $this->funcionario_model
                         ->where('id', $funcionario_id)
                         ->first();
---
SELECT *
FROM `funcionarios`
WHERE `id` = '1'
 LIMIT 1