app/Controllers/Inicio.php

SELECT *
FROM `clientes`
SELECT *
FROM `funcionarios`
---
    public function index()
    {
        $total_de_clientes = count(
            $this->cliente_model->findAll()
        );

        $total_de_funcionarios = count(
            $this->funcionario_model->findAll()
        );