app/Controllers/Login.php

    public function authenticate()
    {
        $dados = $this->request->getVar();

        $usuario = $this->login_model
                        ->where('usuario', $dados['usuario'])
                        ->where('senha', md5($dados['senha']))
                        ->first();
---
SELECT *
FROM `logins`
WHERE `usuario` = 'junnycmenezes@gmail.com'
AND `senha` = '81655032'
 LIMIT 1

    public function store()
    {
        $dados = $this->request->getVar();

        $usuario = $this->login_model
                        ->where('id', 1)
                        ->first();

        $session = session();

        if(md5($dados['senha_atual']) == $usuario['senha']):

            if($dados['nova_senha'] == $dados['nova_senha_confirm']):

                $this->login_model
                    ->where('id', 1)
                    ->set('senha', md5($dados['nova_senha']))
                    ->update();
---
SELECT *
FROM `logins`
WHERE `id` = 1
 LIMIT 1
UPDATE `logins` SET `senha` = '123', `updated_at` = '2024-02-29 17:30:14'
WHERE `id` = 1