app/Controllers/Produto.php

    public function index()
    {
        $data['produtos'] = $this->produto_model
                                 ->findAll();
---
SELECT *
FROM `produtos`